_Rarzrabotki/BASEBuh/Catalogs/СтруктураСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СтруктураСебестоимости</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗастосовуватиПеревіркуОдиниць</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМодулей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗастосовуватиПеревіркуПоЗагальнимНазвам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРаботыМ29</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДомов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗастосовуватиПеревіркуЗаПідрозділом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеЗакупки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеСС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбщиеНазванияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураСС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаСС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеСовпадает</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаСС_Оригинал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСС_Оригинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавленоВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомплектующиеПоМодульно</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модуль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбщиеНазванияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураСС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаСС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеСовпадает</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаСС_Оригинал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСС_Оригинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФайлыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модуль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураСебестоимостиПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗагрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСтрок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИтого</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КоэффициентыПересчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбщиеНазванияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураСС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаСС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОригинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаЗакупки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>9</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникКоэффициента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.А_ИсточникиКоэффициентаПересчетаСС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПересчитанное</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/BASEBuh/Catalogs/СтруктураСебестоимости/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомплектующиеНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.Комплектующие.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ОбщееНазвание) Тогда
        СтандартнаяОбработка = Ложь;
        ПоказатьПредупреждение(, "Спочатку заповніть ""Загальну назву"" у поточному рядку!");
        Возврат;
    КонецЕсли;

    СтандартнаяОбработка = Ложь;

    ПараметрыОткрытия = Новый Структура;
    ПараметрыОткрытия.Вставить("Отбор", Новый Структура("ОбщееНазваниеНоменклатуры, Услуга", ТекущиеДанные.ОбщееНазвание,Ложь));

    ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыОткрытия, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеОбщееНазваниеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Комплектующие.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Если ЗначениеЗаполнено(ТекущиеДанные.ОбщееНазвание) Тогда
       ТекущиеДанные.Номенклатура = ОсновнаяНоменклатура(ТекущиеДанные.ОбщееНазвание);
	   Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		   ТекущиеДанные.Единица = ПолучитьЕдиницу(ТекущиеДанные.Номенклатура);
	   КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ОсновнаяНоменклатура(ОбщееНазвание)
Возврат ОбщееНазвание.ОсновнаяНоменклатура;
КонецФункции

Функция ПолучитьЕдиницу(Номенклатура)
Возврат Номенклатура.БазоваяЕдиницаИзмерения;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Активная Тогда
		Код = ПроверитьАктивные();
		Если Код <> Неопределено Тогда
			Отказ = Истина;
			ПоказатьПредупреждение(, "Вже існує активна структура по підрозділу та складу з кодом " + Код);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


Функция ПроверитьАктивные()
	Возврат Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтруктураСебестоимости.Код КАК Код
	|ИЗ
	|	Справочник.СтруктураСебестоимости КАК СтруктураСебестоимости
	|ГДЕ
	|	СтруктураСебестоимости.Подразделение = &Подразделение
	|	И СтруктураСебестоимости.Склад = &Склад
	|	И СтруктураСебестоимости.Активная
	|	И СтруктураСебестоимости.Ссылка <> &Ссылка";

	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("Склад",  Объект.Склад);
	Запрос.УстановитьПараметр("Ссылка",  Объект.Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Код;
	ИНАЧЕ
		Возврат Неопределено
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура КомплектующиеНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Комплектующие.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;

	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ТекущиеДанные.Единица = ПолучитьЕдиницу(ТекущиеДанные.Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииНаСервере()
Объект.Подразделение = Объект.Склад.Подразделение;
ИзменитьНаименование();

КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	СкладПриИзмененииНаСервере();
КонецПроцедуры

Процедура  ИзменитьНаименование()
	Если ЗначениеЗаполнено(Объект.ПодразделениеОбъекта)  Тогда
		Объект.Наименование = Строка(Объект.ПодразделениеОбъекта) ;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	//ИзменитьНаименование()
КонецПроцедуры

#Область ЗагрузкаМатериаловИзExcel

// Заполняет табличную часть Комплектующие из книги Excel по правилам листа «Проект СС»
// (те же, что у обработки «Загрузка материалов в СС»). Справочник не записывается:
// результат виден в форме, запись — кнопкой «Записать».
&НаКлиенте
Процедура Загрузить(Команда)

    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Заголовок = "Виберіть файл Excel зі структурою собівартості";
    Диалог.Фильтр = "Книги Excel|*.xlsx;*.xls";
    Диалог.МножественныйВыбор = Ложь;

    Диалог.Показать(Новый ОписаниеОповещения("ЗагрузитьЗавершениеВыбораФайла", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершениеВыбораФайла(ВыбранныеФайлы, ДопПараметры) Экспорт

    Если ВыбранныеФайлы = Неопределено ИЛИ ВыбранныеФайлы.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    ВыполнитьЗагрузкуИзФайла(ВыбранныеФайлы[0], ИмяЛистаПоУмолчанию());

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершениеВыбораЛиста(ВыбранныйЭлемент, ДопПараметры) Экспорт

    Если ВыбранныйЭлемент = Неопределено Тогда
        Возврат;
    КонецЕсли;

    ВыполнитьЗагрузкуИзФайла(ДопПараметры.ИмяФайла, ВыбранныйЭлемент.Значение);

КонецПроцедуры

&НаКлиенте
Функция ИмяЛистаПоУмолчанию()
    Возврат "Проект СС";
КонецФункции

&НаКлиенте
Процедура ВыполнитьЗагрузкуИзФайла(ИмяФайла, ИмяЛиста)

    СписокЛистов = Новый СписокЗначений;
    СырыеСтроки = ПрочитатьЛистExcel(ИмяФайла, ИмяЛиста, СписокЛистов);

    Если СырыеСтроки = Неопределено Тогда
        Если СписокЛистов.Количество() > 0 Тогда
            ДопПараметры = Новый Структура("ИмяФайла", ИмяФайла);
            Оповещение = Новый ОписаниеОповещения("ЗагрузитьЗавершениеВыбораЛиста", ЭтотОбъект, ДопПараметры);
            СписокЛистов.ПоказатьВыборЭлемента(Оповещение,
                "Лист «" + ИмяЛиста + "» не знайдено. Оберіть лист для завантаження:");
        КонецЕсли;
        Возврат;
    КонецЕсли;

    Сообщить("Файл прочитан: строк листа «" + ИмяЛиста + "» = " + СырыеСтроки.Количество());

    // Оригинал хранится по модулям; модуль 0 — файл на всю СС.
    ДопПараметры = Новый Структура("ИмяФайла, СырыеСтроки", ИмяФайла, СырыеСтроки);
    ПоказатьВводЧисла(Новый ОписаниеОповещения("ЗагрузитьЗавершениеВводаМодуля", ЭтотОбъект, ДопПараметры),
        0, "Модуль файлу (0 — файл на всю СС)", 10, 0);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершениеВводаМодуля(Модуль, ДопПараметры) Экспорт

    Если Модуль = Неопределено Или Модуль < 0 Тогда
        Возврат;
    КонецЕсли;
    ДопПараметры.Вставить("Модуль", Модуль);

    // Файл-основа присоединяется к записанному элементу.
    Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И НЕ Записать() Тогда
        Сообщить("Структуру собівартості не записано — завантаження скасовано.");
        Возврат;
    КонецЕсли;

    ЕстьРасчетныеСтроки = Ложь;
    Для Каждого СтрокаКомпл Из Объект.Комплектующие Цикл
        Если НЕ СтрокаКомпл.ДобавленоВручную Тогда
            ЕстьРасчетныеСтроки = Истина;
            Прервать;
        КонецЕсли;
    КонецЦикла;

    Если НЕ ЕстьРасчетныеСтроки Тогда
        ВыполнитьЗагрузкуОригинала(ДопПараметры, Истина);
        Возврат;
    КонецЕсли;

    Кнопки = Новый СписокЗначений;
    Кнопки.Добавить(КодВозвратаДиалога.Да, "Перебудувати Комплектуючі");
    Кнопки.Добавить(КодВозвратаДиалога.Нет, "Тільки оригінал");
    Кнопки.Добавить(КодВозвратаДиалога.Отмена, "Скасувати");
    ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьЗавершениеВопросаПерестройки", ЭтотОбъект, ДопПараметры),
        "Оригінал модуля " + Модуль + " буде оновлено з файлу." + Символы.ПС
        + "Перебудувати Комплектуючі з оригіналу всіх модулів? Рядки «Додано вручну» та коефіцієнти "
        + "«Вручну» / «Підібрано за фактом» збережуться, кількості буде перераховано.",
        Кнопки, , КодВозвратаДиалога.Нет);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершениеВопросаПерестройки(Ответ, ДопПараметры) Экспорт

    Если Ответ = КодВозвратаДиалога.Отмена Или Ответ = Неопределено Тогда
        Возврат;
    КонецЕсли;
    ВыполнитьЗагрузкуОригинала(ДопПараметры, Ответ = КодВозвратаДиалога.Да);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуОригинала(ДопПараметры, Перестроить)

    Файл = Новый Файл(ДопПараметры.ИмяФайла);
    АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ДопПараметры.ИмяФайла), УникальныйИдентификатор);

    Протокол = ЗагрузитьОригиналНаСервере(ДопПараметры.СырыеСтроки, ДопПараметры.Модуль, Перестроить,
        АдресФайла, Файл.Имя);
    ВывестиПротоколЗагрузки(Протокол);
    Если Протокол.Свойство("Перестройка") И Протокол.Перестройка <> Неопределено Тогда
        Сообщить("Комплектуючі перебудовано з оригіналу: рядків " + Протокол.Перестройка.Строк
            + ", збережено «Додано вручну» " + Протокол.Перестройка.СохраненоВручную);
        ВывестиПротоколКоэффициентов(Протокол.Перестройка.Коэффициенты, Протокол.Перестройка.Пересчет);
    КонецЕсли;

КонецПроцедуры

// Читает лист книги "как есть", без отбора: какие строки считать материалами,
// решает движок модуля объекта (ОтобратьМатериалы) — правила там одни для всех вызовов.
// Если нужного листа в книге нет — возвращает Неопределено, заполнив СписокЛистов.
&НаКлиенте
Функция ПрочитатьЛистExcel(ИмяФайла, ИмяЛиста, СписокЛистов)

    Попытка
        Excel = Новый COMОбъект("Excel.Application");
    Исключение
        Сообщить("Не вдалося запустити Excel: " + ОписаниеОшибки());
        Возврат Неопределено;
    КонецПопытки;

    СырыеСтроки = Неопределено;
    Попытка
        Excel.Visible = Ложь;
        Excel.DisplayAlerts = Ложь;

        // ReadOnly: файл может быть открыт у пользователя в Excel.
        Книга = Excel.Workbooks.Open(ИмяФайла, 0, Истина);

        Лист = Неопределено;
        Для НомерЛиста = 1 По Книга.Sheets.Count Цикл
            ТекущийЛист = Книга.Sheets(НомерЛиста);
            ИмяТекущегоЛиста = СокрЛП("" + ТекущийЛист.Name);
            СписокЛистов.Добавить(ИмяТекущегоЛиста, ИмяТекущегоЛиста);
            Если НРег(ИмяТекущегоЛиста) = НРег(СокрЛП(ИмяЛиста)) Тогда
                Лист = ТекущийЛист;
            КонецЕсли;
        КонецЦикла;

        Если Лист <> Неопределено Тогда

            ВсегоСтрок = Лист.Cells(1, 1).SpecialCells(11).Row;

            СырыеСтроки = Новый Массив;
            Для Ряд = 2 По ВсегоСтрок Цикл
                Стр = Новый Структура("Ряд, Тип, Этап, ОбщееНазвание, Наименование, Единица, Количество, Сумма");
                Стр.Ряд = Ряд;
                Стр.Тип = СокрЛП("" + Лист.Cells(Ряд, 3).Text);
                Стр.Этап = СокрЛП("" + Лист.Cells(Ряд, 5).Text);
                Стр.Наименование = СокрЛП("" + Лист.Cells(Ряд, 7).Text);
                Стр.ОбщееНазвание = СокрЛП("" + Лист.Cells(Ряд, 8).Text);
                Стр.Единица = СокрЛП("" + Лист.Cells(Ряд, 9).Text);
                Стр.Количество = ЧислоИзЯчейки(Лист.Cells(Ряд, 10).Value);
                Стр.Сумма = ЧислоИзЯчейки(Лист.Cells(Ряд, 15).Value);
                СырыеСтроки.Добавить(Стр);
            КонецЦикла;

        КонецЕсли;

        Книга.Close(Ложь);
        Excel.Quit();
        Excel = Неопределено;
    Исключение
        ТекстОшибки = ОписаниеОшибки();
        Попытка
            Excel.Quit();
        Исключение
        КонецПопытки;
        Excel = Неопределено;
        СписокЛистов.Очистить();
        Сообщить("Помилка читання Excel: " + ТекстОшибки);
        Возврат Неопределено;
    КонецПопытки;

    Возврат СырыеСтроки;

КонецФункции

&НаКлиенте
Функция ЧислоИзЯчейки(Значение)
    Если НЕ ЗначениеЗаполнено(Значение) Тогда
        Возврат 0;
    КонецЕсли;
    Попытка
        Возврат Число(Значение);
    Исключение
        Возврат 0;
    КонецПопытки;
КонецФункции

// Оригинал модуля -> КомплектующиеПоМодульно, файл -> присоединённые файлы СС + строка ФайлыОснования,
// по желанию — перестройка Комплектующие из оригинала всех модулей с пересчётом по коэффициентам.
// Справочник не записывается (кроме самого присоединённого файла — он пишется сразу, как в БСП).
&НаСервере
Функция ЗагрузитьОригиналНаСервере(СырыеСтроки, Модуль, Перестроить, АдресФайла, ИмяФайла)

    ОбъектСправочника = РеквизитФормыВЗначение("Объект");
    Протокол = ОбъектСправочника.ЗаполнитьОригиналИзСырыхСтрок(СырыеСтроки, Модуль);
    Протокол.Вставить("Перестройка", Неопределено);

    // При ошибке форму не трогаем: прежние табличные части остаются у пользователя перед глазами.
    Если Протокол.Ошибка Тогда
        Возврат Протокол;
    КонецЕсли;

    Если Перестроить Тогда
        Протокол.Перестройка = А_СтруктураСебестоимостиСервер.СформироватьКомплектующиеИзОригинала(ОбъектСправочника);
    КонецЕсли;

    Файл = А_СтруктураСебестоимостиСервер.ПрисоединитьФайл(ОбъектСправочника.Ссылка,
        ПолучитьИзВременногоХранилища(АдресФайла), ИмяФайла);
    А_СтруктураСебестоимостиСервер.УстановитьФайлОснования(ОбъектСправочника, Модуль, Файл,
        Протокол.Итоги.Строк, Протокол.Итоги.Сумма);
    Протокол.Инфо.Добавить("Файл-основу приєднано: " + ИмяФайла + " (модуль " + Модуль + ")");

    ЗначениеВРеквизитФормы(ОбъектСправочника, "Объект");
    Модифицированность = Истина;
    Возврат Протокол;

КонецФункции

#Область Перерахунок

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    УстановитьУсловноеОформление();

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

    Источники = Перечисления.А_ИсточникиКоэффициентаПересчетаСС;

    // Строки, которых нет в оригинале, — светло-жёлтым.
    ДобавитьОформлениеСтрок("Комплектующие", "Объект.Комплектующие.ДобавленоВручную", Истина,
        "ЦветФона", Новый Цвет(255, 242, 204));

    // Коэффициент не найден — красный текст, ручной — синий.
    ДобавитьОформлениеСтрок("КоэффициентыПересчета", "Объект.КоэффициентыПересчета.ИсточникКоэффициента",
        Источники.НеНайден, "ЦветТекста", Новый Цвет(192, 0, 0));
    ДобавитьОформлениеСтрок("КоэффициентыПересчета", "Объект.КоэффициентыПересчета.ИсточникКоэффициента",
        Источники.Вручную, "ЦветТекста", Новый Цвет(0, 70, 160));

КонецПроцедуры

&НаСервере
Процедура ДобавитьОформлениеСтрок(ИмяЭлемента, ПутьКПолю, Значение, ИмяПараметра, ЗначениеПараметра)

    ЭлементОформления = УсловноеОформление.Элементы.Добавить();
    ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
    ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолю);
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.ПравоеЗначение = Значение;
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра(ИмяПараметра, ЗначениеПараметра);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоэффициенты(Команда)

    Протокол = ЗаполнитьКоэффициентыНаСервере();
    ВывестиПротоколКоэффициентов(Протокол, Неопределено);

КонецПроцедуры

&НаСервере
Функция ЗаполнитьКоэффициентыНаСервере()

    ОбъектСправочника = РеквизитФормыВЗначение("Объект");
    Протокол = А_СтруктураСебестоимостиСервер.ЗаполнитьКоэффициенты(ОбъектСправочника);
    ЗначениеВРеквизитФормы(ОбъектСправочника, "Объект");
    Модифицированность = Истина;
    Возврат Протокол;

КонецФункции

&НаКлиенте
Процедура ПересчитатьКоличество(Команда)

    Протокол = ПересчитатьКоличествоНаСервере();
    ВывестиПротоколКоэффициентов(Неопределено, Протокол);

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку(Команда)

    ТекущиеДанные = Элементы.КоэффициентыПересчета.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        ПоказатьПредупреждение(, "Виберіть рядок коефіцієнта, який треба перерахувати.");
        Возврат;
    КонецЕсли;
    Если ТекущиеДанные.Коэффициент <= 0 Тогда
        ПоказатьПредупреждение(, "Для рядка «" + ТекущиеДанные.НоменклатураСС + "» (" + ТекущиеДанные.ЕдиницаСС
            + ") не задано коефіцієнт — перерахунок неможливий.");
        Возврат;
    КонецЕсли;
    Протокол = ПересчитатьКоличествоНаСервере(ТекущиеДанные.НомерСтроки);
    ВывестиПротоколКоэффициентов(Неопределено, Протокол);

КонецПроцедуры

&НаСервере
Функция ПересчитатьКоличествоНаСервере(НомерСтрокиКоэф = 0)

    ОбъектСправочника = РеквизитФормыВЗначение("Объект");
    Протокол = А_СтруктураСебестоимостиСервер.ПересчитатьКоличество(ОбъектСправочника, НомерСтрокиКоэф);
    Если НЕ Протокол.Ошибка Тогда
        ЗначениеВРеквизитФормы(ОбъектСправочника, "Объект");
        Модифицированность = Истина;
    КонецЕсли;
    Возврат Протокол;

КонецФункции

&НаКлиенте
Процедура КоэффициентыПересчетаКоэффициентПриИзменении(Элемент)

    ТекущиеДанные = Элементы.КоэффициентыПересчета.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    ТекущиеДанные.ИсточникКоэффициента = ПредопределенноеЗначение("Перечисление.А_ИсточникиКоэффициентаПересчетаСС.Вручную");
    ТекущиеДанные.КоличествоПересчитанное = Окр(ТекущиеДанные.КоличествоОригинал * ТекущиеДанные.Коэффициент, 3);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПравилоВСправочник(Команда)

    ТекущиеДанные = Элементы.КоэффициентыПересчета.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ОбщееНазвание) Или ТекущиеДанные.Коэффициент <= 0 Тогда
        ПоказатьПредупреждение(, "Для правила потрібні загальна назва та коефіцієнт більше нуля.");
        Возврат;
    КонецЕсли;

    Кнопки = Новый СписокЗначений;
    Кнопки.Добавить(КодВозвратаДиалога.Да, "Тільки для цієї позиції");
    Кнопки.Добавить(КодВозвратаДиалога.Нет, "Для всієї загальної назви");
    Кнопки.Добавить(КодВозвратаДиалога.Отмена, "Скасувати");
    ДопПараметры = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
    ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьПравилоЗавершение", ЭтотОбъект, ДопПараметры),
        "«" + ТекущиеДанные.ОбщееНазвание + "»: " + ТекущиеДанные.ЕдиницаСС + " × " + ТекущиеДанные.Коэффициент
        + " = " + ТекущиеДанные.ЕдиницаЗакупки + Символы.ПС
        + "Записати правило для позиції «" + ТекущиеДанные.НоменклатураСС + "» чи для всієї загальної назви?",
        Кнопки, , КодВозвратаДиалога.Да);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПравилоЗавершение(Ответ, ДопПараметры) Экспорт

    Если Ответ <> КодВозвратаДиалога.Да И Ответ <> КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    Заменено = ЗаписатьПравилоНаСервере(ДопПараметры.ИдентификаторСтроки, Ответ = КодВозвратаДиалога.Да);
    ПоказатьОповещениеПользователя(?(Заменено, "Правило оновлено", "Правило додано"), ,
        "Коефіцієнт записано в картку загальної назви");

КонецПроцедуры

&НаСервере
Функция ЗаписатьПравилоНаСервере(ИдентификаторСтроки, ДляПозиции)

    СтрокаКоэф = Объект.КоэффициентыПересчета.НайтиПоИдентификатору(ИдентификаторСтроки);
    Заменено = А_СтруктураСебестоимостиСервер.ЗаписатьПравило(СтрокаКоэф.ОбщееНазвание, СтрокаКоэф.ЕдиницаСС,
        ?(ДляПозиции, СтрокаКоэф.НоменклатураСС, ""), СтрокаКоэф.Коэффициент,
        "з СС «" + Объект.Наименование + "»");
    // Теперь коэффициент строки берётся из правила — при изменении правила «Заповнити» его обновит.
    Источники = Перечисления.А_ИсточникиКоэффициентаПересчетаСС;
    СтрокаКоэф.ИсточникКоэффициента = ?(ДляПозиции, Источники.ПравилоТочное, Источники.ПравилоОбщее);
    Модифицированность = Истина;
    Возврат Заменено;

КонецФункции

&НаКлиенте
Процедура ВывестиПротоколКоэффициентов(ПротоколКоэффициентов, ПротоколПересчета)

    Если ПротоколКоэффициентов <> Неопределено Тогда
        Сообщить("Коефіцієнти: додано " + ПротоколКоэффициентов.Добавлено
            + ", оновлено " + ПротоколКоэффициентов.Обновлено
            + ", видалено " + ПротоколКоэффициентов.Удалено
            + ", збережено ручних/за фактом " + ПротоколКоэффициентов.СохраненоРучных
            + ", не знайдено " + ПротоколКоэффициентов.НеНайдено);
        Для Каждого Строка Из ПротоколКоэффициентов.Детали Цикл
            Сообщить("  " + Строка);
        КонецЦикла;
    КонецЕсли;

    Если ПротоколПересчета <> Неопределено Тогда
        Если ПротоколПересчета.Ошибка Тогда
            Сообщить("ПОМИЛКА перерахунку, Комплектуючі не змінено: " + ПротоколПересчета.ТекстОшибки);
            Возврат;
        КонецЕсли;
        Сообщить("Перераховано рядків Комплектуючих: " + ПротоколПересчета.Пересчитано
            + "; без коефіцієнта: " + ПротоколПересчета.НеНайдено
            + "; немає в Комплектуючих: " + ПротоколПересчета.НетВКомплектующих
            + "; неоднозначно: " + ПротоколПересчета.Неоднозначно
            + ". Σ Сума: " + ПротоколПересчета.СуммаДо + " → " + ПротоколПересчета.СуммаПосле
            + ". Перевірте та натисніть «Записать».");
        Для Каждого Строка Из ПротоколПересчета.Детали Цикл
            Сообщить("  " + Строка);
        КонецЦикла;
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВывестиПротоколЗагрузки(Протокол)

    Если Протокол.Ошибка Тогда
        Сообщить("ОШИБКА загрузки: " + Протокол.ТекстОшибки);
        Сообщить("Табличная часть не изменена, справочник не записан.");
        Возврат;
    КонецЕсли;

    Сообщить("Загрузка завершена. Проверьте данные и нажмите «Записать».");
    Сообщить("  Загружено материалов:   " + Протокол.Загружено);
    Сообщить("  Создано этапов:         " + Протокол.СозданоЭтапов);
    Сообщить("  Создано общих названий: " + Протокол.СозданоНазваний
        + " (из них с единицей: " + Протокол.ЗаполненоЕдиниц + ")");
    Сообщить("  Дозаполнено единиц у существующих названий: " + Протокол.ДозаполненоЕдиниц);
    Сообщить("  Пропущено пустых:       " + Протокол.Пропущено);

    Если Протокол.ПодхваченоБезТипа > 0 Тогда
        Сообщить("  ВНИМАНИЕ: подхвачено строк без проставленного типа «Матеріал»: "
            + Протокол.ПодхваченоБезТипа);
        Для Каждого Строка Из Протокол.ДеталиОтбора Цикл
            Сообщить("    " + Строка);
        КонецЦикла;
    КонецЕсли;

    Для Каждого Строка Из Протокол.Предупреждения Цикл
        Сообщить("  ВНИМАНИЕ: " + Строка);
    КонецЦикла;

    Сообщить(?(Протокол.КонтрольПройден, "КОНТРОЛЬ ЗАГРУЗКИ: ПРОЙДЕН", "КОНТРОЛЬ ЗАГРУЗКИ: НЕ ВЫПОЛНЕН"));
    Для Каждого Строка Из Протокол.Контроль Цикл
        Сообщить("  " + Строка);
    КонецЦикла;
    Для Каждого Строка Из Протокол.Инфо Цикл
        Сообщить("  " + Строка);
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОбъектаПриИзменении(Элемент)
	ИзменитьНаименование();

КонецПроцедуры

#КонецОбласти
